[
  {
    "title": "Frontend Web(3) Engineer",
    "company": "Curve Labs - CL Cybernetix GmbH",
    "begin": "06/2021",
    "end": "10/2022",
    "location": "Berlin, Hybrid",
    "about": "Curve Labs is an innovation network working with Web3 primitives to design, develop and improve blockchain-native organizations more than the sum of their parts.",
    "tasks": [
      "Participated in defining, designing, and developing two of PrimeDAO’s DeFi platform main products: Prime-Launch and Prime-Deals.",
      "Converted business logic into working features using Typescript, Aurelia, Firebase, and Ethers.js.",
      "Cooperated with various players in the WEB3 community to help improve Blockchain tools."
    ]
  },
  {
    "title": "Full-Stack Web Developer",
    "company": "This Is Undefined Ltd.",
    "begin": "03/2021",
    "end": "05/2021",
    "location": "Remote",
    "about": "",
    "tasks": [
      "Developed from scratch an e-commerce platform for the production and event industries to prepare and hire COVID related equipment, as a proof of concept for a client, using ReactJS, Gatsby, Firebase and Prismic.io (for CMS).",
      "Transformed UI designs into responsive and dynamic components using CSS Modules and JSX.",
      "Staging demo: https://tagsupplies.netlify.app/."
    ]
  },
  {
    "title": "Full-Stack Web Developer",
    "company": "Gr8hub GmbH & co. KG.",
    "begin": "05/2020",
    "end": "03/2021",
    "location": "Remote",
    "tasks": [
      "Developed the Minimum Viable Product in NextJS, and ReactJS.",
      "Transformed UI designs into responsive web pages using HTML5, CSS3 and JavaScript.",
      "Mentored and supported the development team by providing guidance and constructive feedback.",
      "Maintained and optimized code for better performance and scalability. "
    ]
  },
  {
    "title": "Software Developer",
    "company": "Trendence Institute GmbH",
    "begin": "12/2018",
    "end": "09/2020",
    "location": "Berlin",
    "about": "Trendence is one of the leading consulting and market research companies for employer branding, personnel marketing, and recruiting.",
    "tasks": [
      "Designed, built, and maintained smart automation tools using VBA, Python and JavaScript.",
      "Merged multiple processes into a single solution, reducing over 1500 development hours yearly."
    ]
  },
  {
    "title": "Data Visualization Manager",
    "company": "Trendence Institute GmbH",
    "begin": "11/2016",
    "end": "12/2018",
    "location": "Berlin",
    "tasks": [
      "Responsible for data visualization of the company's products.",
      "Programming Excel Macros (VBA) to automate production processes.",
      "Modernized and prepared reports for the end clients.",
      "Initiated optimization of the existing quality assurance processes, which lowered the overall test cycle duration by 60%."
    ]
  },
  {
    "title": "Research Analyst",
    "company": "Trendence Institute GmbH",
    "begin": "02/2009",
    "end": "10/2016",
    "location": "Berlin",
    "tasks": ["Conducted data analysis for the core Barometer studies."]
  },
  {
    "title": "IT-Manager",
    "company": "M.I.S Ltd.",
    "begin": "08/2006",
    "end": "10/2007",
    "location": "Israel",
    "about": "M.I.S. (Marketing Information Systems) is a leading company in Israel for mystery shopping services and dedicated market research.",
    "tasks": [
      "Administered, maintained, and acquired the company's technical equipment and peripherals.",
      "Co-ordinated supplier's contracts.",
      "Developed and implemented software solutions used by over 50 call center agents.",
      "Responsible for product implementation, ",
      "Analyzed and designed database architectures."
    ]
  }
]
